## The X-files problem

In [33]:
import pandas as pd
import numpy as np

In [61]:
df = pd.read_csv('ufo_sightings/UFO_sightings.csv')
df

/Users/demetrio/opt/anaconda3/lib/python3.7/site-packages/IPython/core/interactiveshell.py:3166: DtypeWarning: Columns (5,9) have mixed types.Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

,datetime,city,state,country,shape,duration (seconds),duration (hours/min),comments,date posted,latitude,longitude
0,10/10/1949 20:30,san marcos,tx,us,cylinder,2700,45 minutes,This event took place in early fall around 194...,4/27/2004,29.8830556,-97.941111
1,10/10/1949 21:00,lackland afb,tx,NaN,light,7200,1-2 hrs,1949 Lackland AFB&#44 TX. Lights racing acros...,12/16/2005,29.38421,-98.581082
2,10/10/1955 17:00,chester (uk/england),NaN,gb,circle,20,20 seconds,Green/Orange circular disc over Chester&#44 En...,1/21/2008,53.2,-2.916667
3,10/10/1956 21:00,edna,tx,us,circle,20,1/2 hour,My older brother and twin sister were leaving ...,1/17/2004,28.9783333,-96.645833
4,10/10/1960 20:00,kaneohe,hi,us,light,900,15 minutes,AS a Marine 1st Lt. flying an FJ4B fighter/att...,1/22/2004,21.4180556,-157.803611
...,...,...,...,...,...,...,...,...,...,...,...
80327,9/9/2013 21:15,nashville,tn,us,light,600.0,10 minutes,Round from the distance/slowly changing colors...,9/30/2013,36.165833,-86.784444
80328,9/9/2013 22:00,boise,id,us,circle,1200.0,20 minutes,Boise&#44 ID&#44 spherical&#44 20 min&#44 10 r...,9/30/2013,43.613611,-116.202500
80329,9/9/2013 22:00,napa,ca,us,other,1200.0,hour,Napa UFO&#44,9/30/2013,38.297222,-122.284444
80330,9/9/2013 22:20,vienna,va,us,circle,5.0,5 seconds,Saw a five gold lit cicular craft moving fastl...,9/30/2013,38.901111,-77.265556
80331,9/9/2013 23:00,edmond,ok,us,cigar,1020.0,17 minutes,2 witnesses 2 miles apart&#44 Red &amp; White...,9/30/2013,35.652778,-97.477778

In [85]:
data_info = pd.read_excel('./ufo_sightings/data_dictionary.xlsx')
data_info

,datetime,date and time of event,String
0,city,Name of the city,String
1,state,State code of event,String
2,country,Country code of event,String
3,shape,Shape of the UFO,String
4,duration (seconds),Durantion of the sighting in seconds,Numeric
5,duration (hours/min),Durantion of the sighting in hours and minutes,String
6,comments,description of the event,String
7,date posted,Date when the event was reported,Date
8,latitude,Latitude of the city,Numeric
9,longitude,Longitude of the city,Numeric

In [81]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 80332 entries, 0 to 80331
Data columns (total 11 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   datetime              80332 non-null  object
 1   city                  80332 non-null  object
 2   state                 74535 non-null  object
 3   country               70662 non-null  object
 4   shape                 78400 non-null  object
 5   duration (seconds)    80332 non-null  object
 6   duration (hours/min)  80332 non-null  object
 7   comments              80317 non-null  object
 8   date posted           80332 non-null  object
 9   latitude              80332 non-null  object
 10  longitude             80332 non-null  float64
dtypes: float64(1), object(10)
memory usage: 6.7+ MB

In [88]:
number_of_nulls = df.isnull().sum().sum()
number_of_nulls

17414

Entonces, tenemos valores nulos en las variables de: state, country, shape y comments. En total son 17414.
Ahora, serÃ¡ necesario identificar y quitar los renglones donde estos se encuentren.

In [90]:
df_year['year'] =  pd.to_datetime(df_temp['datetime'])
df_year['year']

NameError: name 'self' is not defined

In [84]:
rows, columns = df.shape
cell_count = rows * columns
number_of_nulls = df.isnull().sum().sum()
percentage_of_missing = (number_of_nulls / cell_count) * 100
print(f'Percentage of missing values: {percentage_of_missing}%')

Percentage of missing values: 1.9706852924001756%

In [65]:
df.iloc[66]['comments']

'Flashing object above Charleston&#44 SC'

In [66]:
df.loc[:,'city':'country']

                       city state country
0                san marcos    tx      us
1              lackland afb    tx     NaN
2      chester (uk/england)   NaN      gb
3                      edna    tx      us
4                   kaneohe    hi      us
...                     ...   ...     ...
80327             nashville    tn      us
80328                 boise    id      us
80329                  napa    ca      us
80330                vienna    va      us
80331                edmond    ok      us

[80332 rows x 3 columns]

In [67]:
df.shape

(80332, 11)

In [68]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 80332 entries, 0 to 80331
Data columns (total 11 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   datetime              80332 non-null  object
 1   city                  80332 non-null  object
 2   state                 74535 non-null  object
 3   country               70662 non-null  object
 4   shape                 78400 non-null  object
 5   duration (seconds)    80332 non-null  object
 6   duration (hours/min)  80332 non-null  object
 7   comments              80317 non-null  object
 8   date posted           80332 non-null  object
 9   latitude              80332 non-null  object
 10  longitude             80332 non-null  float64
dtypes: float64(1), object(10)
memory usage: 6.7+ MB

In [69]:
df['country'].unique()

array(['us', nan, 'gb', 'ca', 'au', 'de'], dtype=object)

In [70]:
df['city'].unique()

array(['san marcos', 'lackland afb', 'chester (uk/england)', ...,
       'calmar (canada)', 'aleksandrow (poland)', 'hamstead (hollyridge)'],
      dtype=object)

In [71]:
df['city'].value_counts()

seattle                             525
phoenix                             454
portland                            374
las vegas                           368
los angeles                         353
                                   ...
l&eacute;vis (canada)                 1
parm                                  1
maryland height                       1
langhorne (bermuda)                   1
santa clarita/palmdale (between)      1
Name: city, Length: 19900, dtype: int64

In [72]:
df['country'].value_counts()

us    65114
ca     3000
gb     1905
au      538
de      105
Name: country, dtype: int64

In [73]:
df['latitude'].value_counts()

47.6063889    481
40.7141667    418
33.4483333    417
34.0522222    328
36.1750000    322
             ...
33.783881       1
10.294884       1
39.533338       1
43.6425000      1
39.8169444      1
Name: latitude, Length: 23312, dtype: int64

In [74]:
df.iloc[:,-1].value_counts()

-122.330833    581
-74.006389     529
-112.073333    475
-118.242778    392
-115.136389    388
              ...
-114.073345      1
-122.095679      1
-93.220833       1
-122.151897      1
 127.054377      1
Name: longitude , Length: 19455, dtype: int64

In [76]:
df['datetime'].unique()

array(['10/10/1949 20:30', '10/10/1949 21:00', '10/10/1955 17:00', ...,
       '9/9/2013 22:00', '9/9/2013 22:20', '9/9/2013 23:00'], dtype=object)

In [80]:
df['datetime'].value_counts()

7/4/2010 22:00      36
7/4/2012 22:00      31
11/16/1999 19:00    27
9/19/2009 20:00     26
7/4/2011 22:00      25
                    ..
8/26/2009 20:50      1
7/13/2005 21:55      1
11/3/2008 02:30      1
2/4/2011 20:55       1
11/14/1999 00:45     1
Name: datetime, Length: 69586, dtype: int64